results/factorial-final/security-overhead-final-plaintext-broker5/security-overhead-final-factorial-plaintext-b5-rf5-isr4-msg10240-tps1000-batch131072-acksall-prod6-compnone-trial3/producer-perf-3.log
producer_index=3
producer_count=6
producer_records=16667
producer_throughput=167
23 records sent, 4.5 records/sec (0.04 MB/sec), 731.5 ms avg latency, 4837.0 ms max latency.
1675 records sent, 334.2 records/sec (3.26 MB/sec), 380.9 ms avg latency, 1170.0 ms max latency.
840 records sent, 167.7 records/sec (1.64 MB/sec), 13.3 ms avg latency, 76.0 ms max latency.
838 records sent, 167.2 records/sec (1.63 MB/sec), 12.5 ms avg latency, 56.0 ms max latency.
837 records sent, 167.1 records/sec (1.63 MB/sec), 16.6 ms avg latency, 106.0 ms max latency.
837 records sent, 167.2 records/sec (1.63 MB/sec), 13.9 ms avg latency, 107.0 ms max latency.
835 records sent, 166.9 records/sec (1.63 MB/sec), 12.9 ms avg latency, 71.0 ms max latency.
837 records sent, 167.4 records/sec (1.63 MB/sec), 11.8 ms avg latency, 48.0 ms max latency.
836 records sent, 166.9 records/sec (1.63 MB/sec), 16.2 ms avg latency, 96.0 ms max latency.
832 records sent, 166.4 records/sec (1.62 MB/sec), 18.2 ms avg latency, 139.0 ms max latency.
843 records sent, 168.3 records/sec (1.64 MB/sec), 11.4 ms avg latency, 213.0 ms max latency.
836 records sent, 167.2 records/sec (1.63 MB/sec), 9.9 ms avg latency, 38.0 ms max latency.
834 records sent, 166.8 records/sec (1.63 MB/sec), 9.9 ms avg latency, 42.0 ms max latency.
837 records sent, 166.8 records/sec (1.63 MB/sec), 9.7 ms avg latency, 49.0 ms max latency.
843 records sent, 168.5 records/sec (1.65 MB/sec), 9.3 ms avg latency, 44.0 ms max latency.
836 records sent, 167.1 records/sec (1.63 MB/sec), 11.6 ms avg latency, 54.0 ms max latency.
837 records sent, 167.1 records/sec (1.63 MB/sec), 8.9 ms avg latency, 35.0 ms max latency.
835 records sent, 166.9 records/sec (1.63 MB/sec), 8.4 ms avg latency, 25.0 ms max latency.
835 records sent, 167.0 records/sec (1.63 MB/sec), 8.5 ms avg latency, 27.0 ms max latency.
16667 records sent, 166.930411 records/sec (1.63 MB/sec), 49.85 ms avg latency, 4837.00 ms max latency, 10 ms 50th, 348 ms 95th, 886 ms 99th, 1095 ms 99.9th.